const res = [
  { id: 1, name: "Виручка від основного виробництва" },
  { id: 2, name: "Виручка від допоміжного виробництва" },
  { id: 3, name: "Кредит оботній" },
  { id: 4, name: "Кредит інвестиційний" },
  { id: 5, name: "Інвестиції власні" },
  { id: 6, name: "Інвестиції інвесторські" },
  { id: 7, name: "Інвестиції залучені від інвесторів" },
  { id: 8, name: "Субсидії" },
  { id: 9, name: "Дотації" },
  { id: 10, name: "Поворотня фінансова допомога" },
  { id: 11, name: "Грантові кошти" },
  { id: 12, name: "Не визначино" },
];

export default res;
